nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2 (NO SimAM early)
  
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, SimAM, []]                  # 5-SimAM at P3 (NO channel arg!) ✓
  
  - [-1, 1, Conv, [512, 3, 2]]          # 6-P4/16
  - [-1, 2, C3k2, [512, True]]          # 7
  - [-1, 1, SimAM, []]                  # 8-SimAM at P4 ✓
  
  - [-1, 1, Conv, [1024, 3, 2]]         # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 10
  - [-1, 1, SPPF, [1024, 5]]            # 11
  - [-1, 1, SimAM, []]                  # 12-SimAM at P5 ✓
  - [-1, 2, C2PSA, [1024]]              # 13

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 8], 1, Concat, [1]]                   # 15-cat P4 SimAM ✓
  - [-1, 2, C3k2, [512, False]]                 # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 5], 1, Concat, [1]]                   # 18-cat P3 SimAM ✓
  - [-1, 2, C3k2, [256, False]]                 # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 20
  - [[-1, 16], 1, Concat, [1]]                  # 21-cat head P4
  - [-1, 2, C3k2, [512, False]]                 # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 23
  - [[-1, 13], 1, Concat, [1]]                  # 24-cat head P5
  - [-1, 2, C3k2, [1024, True]]                 # 25 (P5/32-large)

  - [[19, 22, 25], 1, Detect, [nc]]             # 26-Detect(P3, P4, P5)