# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with CBAM attention
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes (will be overridden by dataset yaml)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # YOLO11n with CBAM
  s: [0.50, 0.50, 1024] # YOLO11s with CBAM
  m: [0.50, 1.00, 512] # YOLO11m with CBAM
  l: [1.00, 1.00, 512] # YOLO11l with CBAM
  x: [1.00, 1.50, 512] # YOLO11x with CBAM

# YOLO11n backbone with CBAM attention
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, CBAMCustom, []] # 3-ADD CBAM AFTER STAGE 1 (inherits channels from previous layer)
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, CBAMCustom, []] # 6-ADD CBAM AFTER STAGE 2 (inherits channels)
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]] # 8
  - [-1, 1, CBAMCustom, []] # 9-ADD CBAM AFTER STAGE 3 (inherits channels)
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]] # 11
  - [-1, 1, CBAMCustom, []] # 12-ADD CBAM AFTER STAGE 4 (inherits channels)
  - [-1, 1, SPPF, [1024, 5]] # 13
  - [-1, 2, C2PSA, [1024]] # 14

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 9], 1, Concat, [1]] # 16 cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [[-1, 6], 1, Concat, [1]] # 19 cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 20 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 21
  - [[-1, 17], 1, Concat, [1]] # 22 cat head P4
  - [-1, 2, C3k2, [512, False]] # 23 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 24
  - [[-1, 14], 1, Concat, [1]] # 25 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 26 (P5/32-large)

  - [[20, 23, 26], 1, Detect, [nc]] # 27 Detect(P3, P4, P5)