# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv11s-CBAM model with Convolutional Block Attention Module

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024]

# YOLOv11 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9
  - [-1, 2, C2PSA, [1024]]  # 10

# YOLOv11 head with CBAMCustom attention
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2, [512, False]]  # 13
  - [-1, 1, CBAMCustom, [512]]  # 14 - ADD ATTENTION HERE

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C3k2, [256, False]]  # 17
  - [-1, 1, CBAMCustom, [256]]  # 18 - ADD ATTENTION HERE

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C3k2, [512, False]]  # 21
  - [-1, 1, CBAMCustom, [512]]  # 22 - ADD ATTENTION HERE

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C3k2, [1024, True]]  # 25
  - [-1, 1, CBAMCustom, [1024]]  # 26 - ADD ATTENTION HERE

  - [[18, 22, 26], 1, Detect, [nc]]  # Detect(P3, P4, P5)